Revit 2027 API
StructuralSectionGeneralI.SlopedFlangeAngle Property
 Sloped flange angle. (rad)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SlopedFlangeAngle { get; set; }
Public Property SlopedFlangeAngle As Double
	Get
	Set
public:
property double SlopedFlangeAngle {
	double get ();
	void set (double value);
}
member SlopedFlangeAngle : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionGeneralI Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace